In [12]:
import pandas as pd
import matplotlib.pyplot as plt

In [8]:
df = pd.read_csv('Passengers.csv')
df.head()

   Year  Month    DOMESTIC INTERNATIONAL       TOTAL
0  2002   10.0  48,054,917     9,578,435  57,633,352
1  2002   11.0  44,850,246     9,016,535  53,866,781
2  2002   12.0  49,684,353    10,038,794  59,723,147
3  2003    1.0  43,032,450     9,726,436  52,758,886
4  2003    2.0  41,166,780     8,283,372  49,450,152

In [10]:
df.describe()

            Month
count  248.000000
mean     6.483871
std      3.481551
min      1.000000
25%      3.000000
50%      6.000000
75%     10.000000
max     12.000000